MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM380FYDFG/mcu.h
/******************************************************************************
 * @file:    TMPM380.h
 * @purpose: CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the 
 *           TOSHIBA 'TMPM380' Device Series 
 * @version: V2.0.2.4
 * @date:    2010/03/10
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 ******************************************************************************/

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM380
  * @{
  */

#ifndef __TMPM380_H__
#define __TMPM380_H__

#ifdef __cplusplus
extern "C" {
#endif 

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ****************************************************/
  NonMaskableInt_IRQn           = -14,      /*!< 2 Non Maskable Interrupt                          */
  HardFault_IRQn                = -13,      /*!< 3 Cortex-M3 Hard Fault Interrupt                  */
  MemoryManagement_IRQn         = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt           */
  BusFault_IRQn                 = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                   */
  UsageFault_IRQn               = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                 */
  SVCall_IRQn                   = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                    */
  DebugMonitor_IRQn             = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt              */
  PendSV_IRQn                   = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                    */
  SysTick_IRQn                  = -1,       /*!< 15 Cortex-M3 System Tick Interrupt                */

/******  TMPM380 Specific Interrupt Numbers ********************************************************/
  INT0_IRQn                     = 0,        /*!< Interrupt pin (PJ0)                               */
  INT1_IRQn                     = 1,        /*!< Interrupt pin (PJ1)                               */
  INT2_IRQn                     = 2,        /*!< Interrupt pin (PJ2)                               */
  INT3_IRQn                     = 3,        /*!< Interrupt pin (PJ3)                               */
  INT4_IRQn                     = 4,        /*!< Interrupt pin (PJ4)                               */
  INT5_IRQn                     = 5,        /*!< Interrupt pin (PJ5)                               */
  INTRX0_IRQn                   = 6,        /*!< Serial reception (channel.0)                      */
  INTTX0_IRQn                   = 7,        /*!< Serial transmission (channel.0)                   */
  INTRX1_IRQn                   = 8,        /*!< Serial reception (channel.1)                      */
  INTTX1_IRQn                   = 9,        /*!< Serial transmission (channel.1)                   */
  INTSSP0_IRQn                  = 10,       /*!< Syncronous Serial Port 0                          */
  INTSSP1_IRQn                  = 11,       /*!< Syncronous Serial Port 1                          */
  INTEMG0_IRQn                  = 12,       /*!< PMD0 EMG interrupt (MPT0)                         */
  INTEMG1_IRQn                  = 13,       /*!< PMD1 EMG interrupt (MPT1)                         */
  INTSBI0_IRQn                  = 14,       /*!< Serial Bus Interface 0 interrupt                  */
  INTSBI1_IRQn                  = 15,       /*!< Serial Bus Interface 1 interrupt                  */
  INTADPD0_IRQn                 = 16,       /*!< ADC conversion triggered by PMD0 is finished      */
  INTRTC_IRQn                   = 17,       /*!< Realtime clock interrupt                          */
  INTADPD1_IRQn                 = 18,       /*!< ADC conversion triggered by PMD1 is finished      */
  INTRMCRX_IRQn                 = 19,       /*!< Remote Controller reception interrupt             */
  INTTB00_IRQn                  = 20,       /*!< 16bit TMRB0 compare match detection 0             */
  INTTB01_IRQn                  = 21,       /*!< 16bit TMRB0 compare match detection 1             */
  INTTB10_IRQn                  = 22,       /*!< 16bit TMRB1 compare match detection 0             */
  INTTB11_IRQn                  = 23,       /*!< 16bit TMRB1 compare match detection 1             */
  INTTB40_IRQn                  = 24,       /*!< 16bit TMRB4 compare match detection 0             */
  INTTB41_IRQn                  = 25,       /*!< 16bit TMRB4 compare match detection 1             */
  INTTB50_IRQn                  = 26,       /*!< 16bit TMRB5 compare match detection 0             */
  INTTB51_IRQn                  = 27,       /*!< 16bit TMRB5 compare match detection 1             */
  INTPMD0_IRQn                  = 28,       /*!< PMD0 PWM interrupt (MPT0)                         */
  INTPMD1_IRQn                  = 29,       /*!< PMD1 PWM interrupt (MPT1)                         */
  INTCAP00_IRQn                 = 30,       /*!< 16bit TMRB0 input capture 0                       */
  INTCAP01_IRQn                 = 31,       /*!< 16bit TMRB0 input capture 1                       */
  INTCAP10_IRQn                 = 32,       /*!< 16bit TMRB1 input capture 0                       */
  INTCAP11_IRQn                 = 33,       /*!< 16bit TMRB1 input capture 1                       */
  INTCAP40_IRQn                 = 34,       /*!< 16bit TMRB4 input capture 0                       */
  INTCAP41_IRQn                 = 35,       /*!< 16bit TMRB4 input capture 1                       */
  INTCAP50_IRQn                 = 36,       /*!< 16bit TMRB5 input capture 0                       */
  INTCAP51_IRQn                 = 37,       /*!< 16bit TMRB5 input capture 1                       */
  INT6_IRQn                     = 38,       /*!< Interrupt Pin (PE6/TB3IN/INT6)                    */
  INT7_IRQn                     = 39,       /*!< Interrupt Pin (PE7/TB3OUT/INT7)                   */
  INTRX2_IRQn                   = 40,       /*!< Serial reception (channel.2)                      */
  INTTX2_IRQn                   = 41,       /*!< Serial transmit (channel.2)                       */
  INTADCP0_IRQn                 = 42,       /*!< ADC conversion monitoring function interrupt 0    */
  INTADCP1_IRQn                 = 43,       /*!< ADC conversion monitoring function interrupt 1    */
  INTRX4_IRQn                   = 44,       /*!< Serial reception (channel.4)                      */
  INTTX4_IRQn                   = 45,       /*!< Serial transmit (channel.4)                       */
  INTTB20_IRQn                  = 46,       /*!< 16bit TMRB2 compare match detection 0             */
  INTTB21_IRQn                  = 47,       /*!< 16bit TMRB2 compare match detection 1             */
  INTTB30_IRQn                  = 48,       /*!< 16bit TMRB3 compare match detection 0             */
  INTTB31_IRQn                  = 49,       /*!< 16bit TMRB3 compare match detection 1             */
  INTCAP20_IRQn                 = 50,       /*!< 16bit TMRB2 input capture 0                       */
  INTCAP21_IRQn                 = 51,       /*!< 16bit TMRB2 input capture 1                       */
  INTCAP30_IRQn                 = 52,       /*!< 16bit TMRB3 input capture 0                       */
  INTCAP31_IRQn                 = 53,       /*!< 16bit TMRB3 input capture 1                       */
  INTADSFT_IRQn                 = 54,       /*!< ADC conversion started by software is finished    */
  INTADTMR_IRQn                 = 56,       /*!< ADC conversion triggered by timer is finished     */
  INT8_IRQn                     = 58,       /*!< Interrupt Pin (PA7/TB4IN/INT8)                    */
  INT9_IRQn                     = 59,       /*!< Interrupt Pin (PD3/INT9)                          */
  INTA_IRQn                     = 60,       /*!< Interrupt Pin (PJ6/AIN6/INTA)                     */
  INTB_IRQn                     = 61,       /*!< Interrupt Pin (PJ7/AIN7/INTB)                     */
  INTENC0_IRQn                  = 62,       /*!< Encoder input0 interrupt                          */
  INTENC1_IRQn                  = 63,       /*!< Encoder input1 interrupt                          */
  INTRX3_IRQn                   = 64,       /*!< Serial reception (channel.3)                      */
  INTTX3_IRQn                   = 65,       /*!< Serial transmit (channel.3)                       */
  INTTB60_IRQn                  = 66,       /*!< 16bit TMRB6 compare match detection 0             */
  INTTB61_IRQn                  = 67,       /*!< 16bit TMRB6 compare match detection 1             */
  INTTB70_IRQn                  = 68,       /*!< 16bit TMRB7 compare match detection 0             */
  INTTB71_IRQn                  = 69,       /*!< 16bit TMRB7 compare match detection 1             */
  INTCAP60_IRQn                 = 70,       /*!< 16bit TMRB6 input capture 0                       */
  INTCAP61_IRQn                 = 71,       /*!< 16bit TMRB6 input capture 1                       */
  INTCAP70_IRQn                 = 72,       /*!< 16bit TMRB7 input capture 0                       */
  INTCAP71_IRQn                 = 73,       /*!< 16bit TMRB7 input capture 1                       */
  INTC_IRQn                     = 74,       /*!< Interrupt Pin (PD0/ENCA0/TB5IN/INTC)              */
  INTD_IRQn                     = 75,       /*!< Interrupt Pin (PD2/ENCZ0/INTD)                    */
  INTE_IRQn                     = 76,       /*!< Interrupt Pin (PN7/MT2IN/INTE)                    */
  INTF_IRQn                     = 77,       /*!< Interrupt Pin (PL2/INTF)                          */
  INTDMACERR_IRQn               = 78,       /*!< DMA transfer error                                */
  INTDMACTC_IRQn                = 79,       /*!< DMA end of transfer                               */
  INTMTTB00_IRQn                = 80,       /*!< 16-bit MPT0 IGBT period/ compare match detection 0*/
  INTMTTB01_IRQn                = 81,       /*!< 16-bit MPT0 IGBT trigger/ compare match detection 1           */
  INTMTTB10_IRQn                = 82,       /*!< 16-bit MPT1 IGBT period/ compare match detection 0/Over flow  */
  INTMTTB11_IRQn                = 83,       /*!< 16-bit MPT1 IGBT trigger/ compare match detection 1           */
  INTMTTB20_IRQn                = 84,       /*!< 16-bit MPT2 IGBT period/ compare match detection 0/Over flow  */
  INTMTTB21_IRQn                = 85,       /*!< 16-bit MPT2 IGBT trigger/ compare match detection 1           */
  INTMTCAP00_IRQn               = 86,       /*!< 16-bit MPT0 input capture 0                                   */
  INTMTCAP01_IRQn               = 87,       /*!< 16-bit MPT0 input capture 1                                   */
  INTMTCAP10_IRQn               = 88,       /*!< 16-bit MPT1 input capture 0                                   */
  INTMTCAP11_IRQn               = 89,       /*!< 16-bit MPT1 input capture 1                                   */
  INTMTCAP20_IRQn               = 90,       /*!< 16-bit MPT2 input capture 0                                   */
  INTMTCAP21_IRQn               = 91,       /*!< 16-bit MPT2 input capture 1                                   */
  INTMTEMG0_IRQn                = 92,       /*!< 16-bit MPT0 IGBT EMG interrupt                                */
  INTMTEMG1_IRQn                = 93,       /*!< 16-bit MPT1 IGBT EMG interrupt                                */
  INTMTEMG2_IRQn                = 94,       /*!< 16-bit MPT2 IGBT EMG interrupt                                */
} IRQn_Type;


