MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM380FYDFG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM380.h"                 /* TMPM380 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief General Purpose Input/Output Port (PA)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PA Register                     */
  __IO uint32_t CR;             /*!< PA Control Register             */
  __IO uint32_t FR1;            /*!< PA Function Register 1          */
  __IO uint32_t FR2;            /*!< PA Function Register 1          */
       uint32_t RESERVED0[6];                                        
  __IO uint32_t OD;             /*!<  PA open drain Control register */
  __IO uint32_t PUP;            /*!< PA Pull-up Control Register     */
  __IO uint32_t PDN;            /*!< PA Pull-down Control Register   */
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PA Input Enable Control Register*/
} TSB_PA_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PB)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PB Register                      */
  __IO uint32_t CR;             /*!< PB Control Register              */
  __IO uint32_t FR1;            /*!< PB Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;             /*!< PB open drain Control register   */
  __IO uint32_t PUP;            /*!< PB Pull-Up Control Register      */
  __IO uint32_t PDN;            /*!< PB pull-down control register    */
       uint32_t RESERVED1; 
  __IO uint32_t IE;             /*!< PB Input Enable Control Register */
} TSB_PB_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PC)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PC Register                      */
  __IO uint32_t CR;             /*!< PC control register              */
  __IO uint32_t FR1;            /*!< PC function register 1           */
  __IO uint32_t FR2;            /*!< PC function register 2           */
  __IO uint32_t FR3;            /*!< PC function register 3           */
  __IO uint32_t FR4;            /*!< PC function register 4           */
  __IO uint32_t FR5;            /*!< PC function register 5           */
       uint32_t RESERVED0[3];
  __IO uint32_t OD;             /*!< PC open drain Control register   */
  __IO uint32_t PUP;            /*!< PC Pull-Up Control Register      */
  __IO uint32_t PDN;            /*!< PC pull-down control register    */
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PC Input Enable Control Register */
} TSB_PC_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PD)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PD Register                      */
  __IO uint32_t CR;             /*!< PD control register              */
  __IO uint32_t FR1;            /*!< PD Function Register 1           */
  __IO uint32_t FR2;            /*!< PD Function Register 2           */
  __IO uint32_t FR3;            /*!< PD Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PD open drain control register   */
  __IO uint32_t PUP;            /*!< PD Pull-Up Control Register      */
  __IO uint32_t PDN;            /*!< PD pull-down control register    */
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PD Input Enable Control Register */
} TSB_PD_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PE)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PE Register                      */
  __IO uint32_t CR;             /*!< PE Control Register              */
  __IO uint32_t FR1;            /*!< PE Function Register 1           */
  __IO uint32_t FR2;            /*!< PE Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;             /*!< PE Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PE Pull-Up Control Register      */
  __IO uint32_t PDN;            /*!< PE pull-down control register    */
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PE Input Enable Control Register */
} TSB_PE_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PF)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PF Register                      */
  __IO uint32_t CR;             /*!< PF Control Register              */
  __IO uint32_t FR1;            /*!< PF Function Register 1           */
  __IO uint32_t FR2;            /*!< PF Function Register 2           */
  __IO uint32_t FR3;            /*!< PF Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PF Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PF Pull-Up Control Register      */
  __IO uint32_t PDN;            /*!< PF pull-down control register    */
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PF Input Enable Control Register */
} TSB_PF_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PG)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PG Register                      */
  __IO uint32_t CR;             /*!< PG Control Register              */
  __IO uint32_t FR1;            /*!< PG Function Register 1           */
  __IO uint32_t FR2;            /*!< PG Function Register 2           */
  __IO uint32_t FR3;            /*!< PG Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PG Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PG Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PG Input Enable Control Register */
} TSB_PG_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PH)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PH Register                      */
  __IO uint32_t CR;             /*!< PH Control Register              */
  __IO uint32_t FR1;            /*!< PH Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PH Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PH Input Enable Control Register */
} TSB_PH_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PI)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PI Register                      */
  __IO uint32_t CR;             /*!< PI Control Register              */
       uint32_t RESERVED0[8];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PI Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PI Input Enable Control Register */
} TSB_PI_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PJ)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PJ Register                      */
  __IO uint32_t CR;             /*!< PJ Control Register              */
  __IO uint32_t FR1;            /*!< PJ Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PJ Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PJ Input Enable Control Register */
} TSB_PJ_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PL)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PL Register                      */
  __IO uint32_t CR;             /*!< PL Control Register              */
  __IO uint32_t FR1;            /*!< PL Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PL Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PL Input Enable Control Register */
} TSB_PL_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PM)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PM Register                      */
  __IO uint32_t CR;             /*!< PM Control Register              */
       uint32_t RESERVED0[8];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PM Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PM Input Enable Control Register */
} TSB_PM_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PN)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PN Register                      */
  __IO uint32_t CR;             /*!< PN Control Register              */
  __IO uint32_t FR1;            /*!< PN Function Register 1           */
  __IO uint32_t FR2;            /*!< PN Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PN Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PN Input Enable Control Register */
} TSB_PN_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PP)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PP Register                      */
  __IO uint32_t CR;             /*!< PP Control Register              */
       uint32_t RESERVED0[8];
  __IO uint32_t OD;
  __IO uint32_t PUP;            /*!< PP Pull-Up Control Register      */
  __IO uint32_t PDN;
       uint32_t RESERVED1;
  __IO uint32_t IE;             /*!< PP Input Enable Control Register */
} TSB_PP_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;             /*!< TB Enable Register            */
  __IO uint32_t RUN;            /*!< TB RUN Register               */
  __IO uint32_t CR;             /*!< TB Control Register           */
  __IO uint32_t MOD;            /*!< TB Mode Register              */
  __IO uint32_t FFCR;           /*!< TB Flip-Flop Control Register */
  __I  uint32_t ST;             /*!< TB Status Register            */
  __IO uint32_t IM;             /*!< TB Interrupt Mask Register    */
  __I  uint32_t UC;             /*!< TB Read Capture Register      */
  __IO uint32_t RG0;            /*!< TB RG0 Timer Register         */
  __IO uint32_t RG1;            /*!< TB RG1 Timer Register         */
  __I  uint32_t CP0;            /*!< TB CP0 Capture Register       */
  __I  uint32_t CP1;            /*!< TB CP1 Capture Register       */
} TSB_TB_TypeDef;

/**
  * @brief Encoder input (ENC)
  */
typedef struct
{
  __IO uint32_t TNCR;           /*!< Encoder  Input Control Register    */
  __IO uint32_t RELOAD;         /*!< Encoder  Counter Reload Register   */
  __IO uint32_t INT;            /*!< Encoder  Compare Register          */
  __IO uint32_t CNT;            /*!< Encoder  Counter Register          */
} TSB_EN_TypeDef;

