MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM380FYDFG/mcu.h
#if defined ( __CC_ARM   )          /* RealView Compiler */
#pragma anon_unions 
#elif (defined (__ICCARM__))        /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief Serial Bus Interface (SBI)
  */
typedef struct
{
  __IO uint32_t CR0;            /*!< SBI Control Register 0       */
  __IO uint32_t CR1;            /*!< SBI Control Register 1       */
  __IO uint32_t DBR;            /*!< SBI Data Buffer Register     */
  __IO uint32_t I2CAR;          /*!< SBI I2C Bus Address Register */
  union {
  __O  uint32_t CR2;            /*!< SBI Control Register 2       */
  __I  uint32_t SR;             /*!< SBI Status Register          */
  };
  __IO uint32_t BR0;            /*!< SBI Baud Rate Register 0     */
} TSB_SBI_TypeDef;

/**
  * @brief Serial Channel (SC)
  */
typedef struct
{
  __IO uint32_t EN;             /*!< SC Enable Register                        */
  __IO uint32_t BUF;            /*!< SC Buffer Register                        */
  __IO uint32_t CR;             /*!< SC Control Register                       */
  __IO uint32_t MOD0;           /*!< SC Mode Control Register 0                */
  __IO uint32_t BRCR;           /*!< SC Baud Rate Generator Control Register   */
  __IO uint32_t BRADD;          /*!< SC Baud Rate Generator Control Register 2 */
  __IO uint32_t MOD1;           /*!< SC Mode Control Register 1                */
  __IO uint32_t MOD2;           /*!< SC Mode Control Register 2                */
  __IO uint32_t RFC;            /*!< SC RX FIFO Configuration Register         */
  __IO uint32_t TFC;            /*!< SC TX FIFO Configuration Register         */
  __I  uint32_t RST;            /*!< SC RX FIFO Status Register                */
  __I  uint32_t TST;            /*!< SC TX FIFO Status Register                */
  __IO uint32_t FCNF;           /*!< SC FIFO Configuration Register            */
} TSB_SC_TypeDef;

/**
  * @brief Analog-to-Digital Converter (AD)
  */
typedef struct
{
  __IO uint32_t CLK;            /*!< AD Conversion Clock Setting Register          */
  __IO uint32_t MOD0;           /*!< AD Mode Setting Register 0                    */
  __IO uint32_t MOD1;           /*!< AD Mode Setting Register 1                    */
  __I  uint32_t MOD2;           /*!< AD Mode Setting Register 2                    */
  __IO uint32_t CMPCR0;         /*!< AD Monitoring Setting Register 0              */
  __IO uint32_t CMPCR1;         /*!< AD Monitoring Setting Register 1              */
  __IO uint32_t CMP0;           /*!< AD Conversion Result Comparison Register 0    */
  __IO uint32_t CMP1;           /*!< AD Conversion Result Comparison Register 1    */
  __I  uint32_t REG0;           /*!< AD Conversion Result Register 0               */
  __I  uint32_t REG1;           /*!< AD Conversion Result Register 1               */
  __I  uint32_t REG2;           /*!< AD Conversion Result Register 2               */
  __I  uint32_t REG3;           /*!< AD Conversion Result Register 3               */
  __I  uint32_t REG4;           /*!< AD Conversion Result Register 4               */
  __I  uint32_t REG5;           /*!< AD Conversion Result Register 5               */
  __I  uint32_t REG6;           /*!< AD Conversion Result Register 6               */
  __I  uint32_t REG7;           /*!< AD Conversion Result Register 7               */
  __I  uint32_t REG8;           /*!< AD Conversion Result Register 8               */
  __I  uint32_t REG9;           /*!< AD Conversion Result Register 9               */
  __I  uint32_t REG10;          /*!< AD Conversion Result Register 10              */
  __I  uint32_t REG11;          /*!< AD Conversion Result Register 11              */
  __IO uint32_t PSEL0;          /*!< PMD Trigger Program Number Select Register 0  */
  __IO uint32_t PSEL1;          /*!< PMD Trigger Program Number Select Register 1  */
  __IO uint32_t PSEL2;          /*!< PMD Trigger Program Number Select Register 2  */
  __IO uint32_t PSEL3;          /*!< PMD Trigger Program Number Select Register 3  */
       uint32_t RESERVED0[8];
  __IO uint32_t PINTS0;         /*!< PMD Trigger Interrupt Select Register 0       */
  __IO uint32_t PINTS1;         /*!< PMD Trigger Interrupt Select Register 1       */
  __IO uint32_t PINTS2;         /*!< PMD Trigger Interrupt Select Register 2       */
  __IO uint32_t PINTS3;         /*!< PMD Trigger Interrupt Select Register 3       */
  __IO uint32_t PINTS4;         /*!< PMD Trigger Interrupt Select Register 4       */
  __IO uint32_t PINTS5;         /*!< PMD Trigger Interrupt Select Register 5       */
  __IO uint8_t  PSET00;         /*!< PMD Trigger Program Register 00               */
  __IO uint8_t  PSET01;         /*!< PMD Trigger Program Register 01               */
  __IO uint8_t  PSET02;         /*!< PMD Trigger Program Register 02               */
  __IO uint8_t  PSET03;         /*!< PMD Trigger Program Register 03               */
  __IO uint8_t  PSET10;         /*!< PMD Trigger Program Register 10               */
  __IO uint8_t  PSET11;         /*!< PMD Trigger Program Register 11               */
  __IO uint8_t  PSET12;         /*!< PMD Trigger Program Register 12               */
  __IO uint8_t  PSET13;         /*!< PMD Trigger Program Register 13               */
  __IO uint8_t  PSET20;         /*!< PMD Trigger Program Register 20               */
  __IO uint8_t  PSET21;         /*!< PMD Trigger Program Register 21               */
  __IO uint8_t  PSET22;         /*!< PMD Trigger Program Register 22               */
  __IO uint8_t  PSET23;         /*!< PMD Trigger Program Register 23               */
  __IO uint8_t  PSET30;         /*!< PMD Trigger Program Register 30               */
  __IO uint8_t  PSET31;         /*!< PMD Trigger Program Register 31               */
  __IO uint8_t  PSET32;         /*!< PMD Trigger Program Register 32               */
  __IO uint8_t  PSET33;         /*!< PMD Trigger Program Register 33               */
  __IO uint8_t  PSET40;         /*!< PMD Trigger Program Register 40               */
  __IO uint8_t  PSET41;         /*!< PMD Trigger Program Register 41               */
  __IO uint8_t  PSET42;         /*!< PMD Trigger Program Register 42               */
  __IO uint8_t  PSET43;         /*!< PMD Trigger Program Register 43               */
  __IO uint8_t  PSET50;         /*!< PMD Trigger Program Register 50               */
  __IO uint8_t  PSET51;         /*!< PMD Trigger Program Register 51               */
  __IO uint8_t  PSET52;         /*!< PMD Trigger Program Register 52               */
  __IO uint8_t  PSET53;         /*!< PMD Trigger Program Register 53               */
  __IO uint8_t  TSET0;          /*!< Timer Trigger Program Register 0              */
  __IO uint8_t  TSET1;          /*!< Timer Trigger Program Register 1              */
  __IO uint8_t  TSET2;          /*!< Timer Trigger Program Register 2              */
  __IO uint8_t  TSET3;          /*!< Timer Trigger Program Register 3              */
  __IO uint8_t  TSET4;          /*!< Timer Trigger Program Register 4              */
  __IO uint8_t  TSET5;          /*!< Timer Trigger Program Register 5              */
  __IO uint8_t  TSET6;          /*!< Timer Trigger Program Register 6              */
  __IO uint8_t  TSET7;          /*!< Timer Trigger Program Register 7              */
  __IO uint8_t  TSET8;          /*!< Timer Trigger Program Register 8              */
  __IO uint8_t  TSET9;          /*!< Timer Trigger Program Register 9              */
  __IO uint8_t  TSET10;         /*!< Timer Trigger Program Register 10             */
  __IO uint8_t  TSET11;         /*!< Timer Trigger Program Register 11             */
  __IO uint8_t  SSET0;          /*!< Software Trigger Program Register 0           */
  __IO uint8_t  SSET1;          /*!< Software Trigger Program Register 1           */
  __IO uint8_t  SSET2;          /*!< Software Trigger Program Register 2           */
  __IO uint8_t  SSET3;          /*!< Software Trigger Program Register 3           */
  __IO uint8_t  SSET4;          /*!< Software Trigger Program Register 4           */
  __IO uint8_t  SSET5;          /*!< Software Trigger Program Register 5           */
  __IO uint8_t  SSET6;          /*!< Software Trigger Program Register 6           */
  __IO uint8_t  SSET7;          /*!< Software Trigger Program Register 7           */
  __IO uint8_t  SSET8;          /*!< Software Trigger Program Register 8           */
  __IO uint8_t  SSET9;          /*!< Software Trigger Program Register 9           */
  __IO uint8_t  SSET10;         /*!< Software Trigger Program Register 10          */
  __IO uint8_t  SSET11;         /*!< Software Trigger Program Register 11          */
  __IO uint8_t  ASET0;          /*!< Constant Trigger Program Register 0           */
  __IO uint8_t  ASET1;          /*!< Constant Trigger Program Register 1           */
  __IO uint8_t  ASET2;          /*!< Constant Trigger Program Register 2           */
  __IO uint8_t  ASET3;          /*!< Constant Trigger Program Register 3           */
  __IO uint8_t  ASET4;          /*!< Constant Trigger Program Register 4           */
  __IO uint8_t  ASET5;          /*!< Constant Trigger Program Register 5           */
  __IO uint8_t  ASET6;          /*!< Constant Trigger Program Register 6           */
  __IO uint8_t  ASET7;          /*!< Constant Trigger Program Register 7           */
  __IO uint8_t  ASET8;          /*!< Constant Trigger Program Register 8           */
  __IO uint8_t  ASET9;          /*!< Constant Trigger Program Register 9           */
  __IO uint8_t  ASET10;         /*!< Constant Trigger Program Register 10          */
  __IO uint8_t  ASET11;         /*!< Constant Trigger Program Register 11          */
  __IO uint32_t MOD3;           /*!< ADC Mode Setting Register 3                   */
} TSB_AD_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t MOD;            /*!< WD Mode Register    */
  __O  uint32_t CR;             /*!< WD Control Register */
} TSB_WD_TypeDef;


/**
  * @brief Real Time Clock (RTC)
  */
typedef struct
{
  __IO uint8_t SECR;            /*!< RTC Second Column Register          */
  __IO uint8_t MINR;            /*!< RTC Minute Column Register          */
  __IO uint8_t HOURR;           /*!< RTC Hour Column Register            */
       uint8_t RESERVED0;
  __IO uint8_t DAYR;            /*!< RTC Day of the Week Column Register */
  __IO uint8_t DATER;           /*!< RTC Day Column Register             */
  __IO uint8_t MONTHR;          /*!< RTC Month Column Register           */
  __IO uint8_t YEARR;           /*!< RTC Year Column Register            */
  __IO uint8_t PAGER;           /*!< RTC PAGE Register                   */
       uint8_t RESERVED1[3];
  __IO uint8_t RESTR;           /*!< RTC Reset Register                  */
} TSB_RTC_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t SYSCR;          /*!< System Control Register              */
  __IO uint32_t OSCCR;          /*!< Oscillation Control Register         */
  __IO uint32_t STBYCR;         /*!< Standby Control Register             */
  __IO uint32_t PLLSEL;         /*!< PLL Selection Register               */
  __IO uint32_t CKSEL;          /*!< System Clock Selection Register      */
  __IO uint32_t ICRCG;          /*!< CG Interrupt Request Clear Register  */
  __I  uint32_t NMIFLG;         /*!< NMI Flag Register                    */
  __IO uint32_t RSTFLG;         /*!< Reset Flag Register                  */
  __IO uint32_t IMCGA;          /*!< CG Interrupt Mode Control Register A */
  __IO uint32_t IMCGB;          /*!< CG Interrupt Mode Control Register B */
  __IO uint32_t IMCGC;          /*!< CG Interrupt Mode Control Register C */
  __IO uint32_t IMCGD;          /*!< CG Interrupt Mode Control Register D */
  __IO uint32_t IMCGE;          /*!< CG Interrupt Mode Control Register E */
} TSB_CG_TypeDef;

/**
  * @brief Remote Control Signal Preprocessor (RMC)
  */
typedef struct
{
  __IO uint32_t EN;             /*!< RMC Enable Register                */
  __IO uint32_t REN;            /*!< RMC Receive Enable Register        */
  __I  uint32_t RBUF1;          /*!< RMC Receive Data Buffer Register 1 */
  __I  uint32_t RBUF2;          /*!< RMC Receive Data Buffer Register 2 */
  __I  uint32_t RBUF3;          /*!< RMC Receive Data Buffer Register 3 */
  __IO uint32_t RCR1;           /*!< RMC Receive Control Register 1     */
  __IO uint32_t RCR2;           /*!< RMC Receive Control Register 2     */
  __O  uint32_t RCR3;           /*!< RMC Receive Control Register 3     */
  __IO uint32_t RCR4;           /*!< RMC Receive Control Register 4     */
  __I  uint32_t RSTAT;          /*!< RMC Receive Status Register        */
       uint32_t RESERVED0[3];
  __IO uint32_t FSSEL;          /*!< RMC Source Clock Select Register   */
} TSB_RMC_TypeDef;


/**
  * @brief Oscillation Frequency Detector (OFD)
  */
typedef struct
{
  __IO uint32_t CR1;            /*!< OFD Control Register 1            */
  __IO uint32_t CR2;            /*!< OFD Control Register 2            */
  __IO uint32_t MN;             /*!< OFD MIN Value setting Register    */
       uint32_t RESERVED0;
  __IO uint32_t MX;             /*!< OFD MAX Value setting Register    */
       uint32_t RESERVED1;
  __IO uint32_t RST;
  __I  uint32_t STAT;
} TSB_OFD_TypeDef;

/**
  * @brief Power on reset (POR), Voltage detecting circuit (VLTD)
  */
typedef struct
{
  __IO uint32_t CR;             /*!< VD Control Register              */
  __I  uint32_t SR;             /*!<Voltage detection status register */
} TSB_VD_TypeDef; 
  
/**
  * @brief Multi purpose timer (PMD)
  */
typedef struct
{
  __IO uint32_t MDEN;               /*!<PMD Enable Register                     */
  __IO uint32_t PORTMD;             /*!<Port Output Mode Register               */
  __IO uint32_t MDCR;               /*!<PMD Control Register                    */
  __I  uint32_t CNTSTA;             /*!<PWM Counter Status Register             */
  __I  uint32_t MDCNT;              /*!<PWM Counter Register                    */
  __IO uint32_t MDPRD;              /*!<PWM Period Register                     */
  __IO uint32_t CMPU;               /*!<PWM Compare Registers                   */
  __IO uint32_t CMPV;               /*!<PWM Compare Registers                   */
  __IO uint32_t CMPW;               /*!<PWM Compare Registers                   */
       uint32_t RESERVED0;          
  __IO uint32_t MDOUT;              /*!<PMD Output Control Register             */
  __IO uint32_t MDPOT;              /*!<PMD Output Setting Register             */
  __O  uint32_t EMGREL;             /*!<EMG Release Register                    */
  __IO uint32_t EMGCR;              /*!<EMG Control Register                    */
  __I  uint32_t EMGST;              /*!<EMG Status Register                     */
       uint32_t RESERVED1[2];                                  
  __IO uint32_t DTR;                /*!<Dead Time Register                      */
  __IO uint32_t TRGCMP0;            /*!<Trigger Compare Registers 0             */
  __IO uint32_t TRGCMP1;            /*!<Trigger Compare Registers 1             */
       uint32_t RESERVED2[2];
  __IO uint32_t TRGCR;              /*!<Trigger Control Register                */
  __IO uint32_t TRGMD;              /*!<Trigger Output Mode Setting Register    */
} TSB_MTPD_TypeDef;

/**
  * @brief Multi purpose timer (TMR/IGBT)
  */
typedef struct
{
  __IO uint32_t EN;                /*!<MPT enable register            */
  __IO uint32_t RUN;               /*!<MPT RUN register               */
  __IO uint32_t TBCR;              /*!<MPT control register           */
  __IO uint32_t TBMOD;             /*!<MPT mode register              */
  __IO uint32_t TBFFCR;            /*!<MPT flip-flop control register */
  __I  uint32_t TBST;              /*!<MPT status register            */
  __IO uint32_t TBIM;              /*!<MPT interrupt mask register    */
  __I  uint32_t TBUC;              /*!<MPT read capture register      */
  __IO uint32_t RG0;               /*!<MPT timer register 0           */
  __IO uint32_t RG1;               /*!<MPT timer register 1           */
  __I  uint32_t CP0;               /*!<MPT capture register 0         */
  __I  uint32_t CP1;               /*!<MPT capture register 1         */
  __IO uint32_t IGCR;              /*!<IGBT control register          */
  __O  uint32_t IGRESTA;           /*!<IGBT timer restart register    */
  __I  uint32_t IGST;              /*!<IGBT timer status register     */
  __IO uint32_t IGICR;             /*!<IGBT input control register    */
  __IO uint32_t IGOCR;             /*!<IGBT output control register   */
  __IO uint32_t IGRG2;             /*!<IGBT timer register2           */
  __I  uint32_t IGRG3;             /*!<IGBT timer register3           */
  __I  uint32_t IGRG4;             /*!<IGBT timer register4           */
  __IO uint32_t IGEMGCR;           /*!<IGBT EMG control register      */
  __I  uint32_t IGEMGST;           /*!<IGBT EMG status register       */
} TSB_MT_TypeDef;

/**
  * @brief DMA controller (DMAC)
  */
typedef struct
{
  __I  uint32_t INTSTATUS;             /*!< DMAC Interrupt Status Register                    */
  __I  uint32_t INTTCSTATUS;           /*!< DMAC Interrupt Terminal Count Status Register     */
  __O  uint32_t INTTCCLEAR;            /*!< DMAC Interrupt Terminal Count Clear Register      */
  __I  uint32_t INTERRORSTATUS;        /*!< DMAC Interrupt Error Status Register              */
  __O  uint32_t INTERRCLR;             /*!< DMAC Interrupt Error Clear Register               */
  __I  uint32_t RAWINTTCSTATUS;        /*!< DMAC Raw Interrupt Terminal Count Status Register */
  __I  uint32_t RAWINTERRORSTATUS;     /*!< DMAC Raw Error Interrupt Status Register          */
  __I  uint32_t ENBLDCHNS;             /*!< DMAC Enabled Channel Register                     */
  __IO uint32_t SOFTBREQ;              /*!< DMAC Software Burst Request Register              */
  __IO uint32_t SOFTSREQ;              /*!< DMAC Software Single Request Register             */
       uint32_t RESERVED0[2];                                                          
  __IO uint32_t CONFIGURATION;         /*!< DMAC Configuration Register                       */
       uint32_t RESERVED1[51];                                                         
  __IO uint32_t C0SRCADDR;             /*!< DMAC Channel0 Source Address Register             */
  __IO uint32_t C0DESTADDR;            /*!< DMAC Channel0 Destination Address Register        */
  __IO uint32_t C0LLI;                 /*!< DMAC Channel0 Linked List Item Register           */
  __IO uint32_t C0CONTROL;             /*!< DMAC Channel0 Control Register                    */
  __IO uint32_t C0CONFIGURATION;       /*!< DMAC Channel0 Configuration Register              */
       uint32_t RESERVED3[3];                                                          
  __IO uint32_t C1SRCADDR;             /*!< DMAC Channel1 Source Address Register             */
  __IO uint32_t C1DESTADDR;            /*!< DMAC Channel1 Destination Address Register        */
  __IO uint32_t C1LLI;                 /*!< DMAC Channel1 Linked List Item Register           */
  __IO uint32_t C1CONTROL;             /*!< DMAC Channel1 Control Register                    */
  __IO uint32_t C1CONFIGURATION;       /*!< DMAC Channel1 Configuration Register              */
} TSB_DMAC_TypeDef;


/**
  * @brief Synchronous Serial Port (SSP)
  */
typedef struct
{
  __IO uint32_t CR0;             /*!< SSP Control Register 0                   */
  __IO uint32_t CR1;             /*!< SSP Control Register 1                   */
  __IO uint32_t DR;              /*!< SSP Data Register                        */
  __I  uint32_t SR;              /*!< SSP Status Register                      */
  __IO uint32_t CPSR;            /*!< SSP Clock Prescale Register              */
  __IO uint32_t IMSC;            /*!< SSP Interrupt Mask Set And Clear Register*/
  __I  uint32_t RIS;             /*!< SSP Raw Interrupt Status Register        */
  __I  uint32_t MIS;             /*!< SSP Masked Interrupt Status Register     */
  __O  uint32_t ICR;             /*!< SSP Interrupt Clear Register             */
  __IO uint32_t DMACR;           /*!< SSP DMA control register                 */
} TSB_SSP_TypeDef;

/**
  * @brief Flash Control (FC)
  */
typedef struct
{
  __IO uint32_t SECBIT;          /*!< FC Security Bit Register  */
       uint32_t RESERVED0[3];
  __I  uint32_t FLCS;            /*!< FC Flash Control Register */
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_PA_BASE               (PERI_BASE  + 0x0000000UL)
#define TSB_PB_BASE               (PERI_BASE  + 0x0000040UL)
#define TSB_PC_BASE               (PERI_BASE  + 0x0000080UL)
#define TSB_PD_BASE               (PERI_BASE  + 0x00000C0UL)
#define TSB_PE_BASE               (PERI_BASE  + 0x0000100UL)
#define TSB_PF_BASE               (PERI_BASE  + 0x0000140UL)
#define TSB_PG_BASE               (PERI_BASE  + 0x0000180UL)
#define TSB_PH_BASE               (PERI_BASE  + 0x00001C0UL)
#define TSB_PI_BASE               (PERI_BASE  + 0x0000200UL)
#define TSB_PJ_BASE               (PERI_BASE  + 0x0000240UL)
#define TSB_PL_BASE               (PERI_BASE  + 0x00002C0UL)
#define TSB_PM_BASE               (PERI_BASE  + 0x0000300UL)
#define TSB_PN_BASE               (PERI_BASE  + 0x0000340UL)
#define TSB_PP_BASE               (PERI_BASE  + 0x0000380UL)

#define TSB_TB0_BASE              (PERI_BASE  + 0x0010000UL)
#define TSB_TB1_BASE              (PERI_BASE  + 0x0010040UL)
#define TSB_TB2_BASE              (PERI_BASE  + 0x0010080UL)
#define TSB_TB3_BASE              (PERI_BASE  + 0x00100C0UL)
#define TSB_TB4_BASE              (PERI_BASE  + 0x0010100UL)
#define TSB_TB5_BASE              (PERI_BASE  + 0x0010140UL)
#define TSB_TB6_BASE              (PERI_BASE  + 0x0010180UL)
#define TSB_TB7_BASE              (PERI_BASE  + 0x00101C0UL)

#define TSB_EN0_BASE              (PERI_BASE  + 0x0010400UL)
#define TSB_EN1_BASE              (PERI_BASE  + 0x0010500UL)

#define TSB_SBI0_BASE             (PERI_BASE  + 0x0020000UL)
#define TSB_SBI1_BASE             (PERI_BASE  + 0x0020020UL)

#define TSB_SC0_BASE              (PERI_BASE  + 0x0020080UL)
#define TSB_SC1_BASE              (PERI_BASE  + 0x00200C0UL)
#define TSB_SC2_BASE              (PERI_BASE  + 0x0020100UL)
#define TSB_SC3_BASE              (PERI_BASE  + 0x0020140UL)
#define TSB_SC4_BASE              (PERI_BASE  + 0x0020180UL)

