MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM380FYDFG/mcu.h
/* Analog-to-Digital Converter (AD) */
#define TSB_AD_MOD0_ADSS                 (*((__O  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0,0)))
#define TSB_AD_MOD1_ADAS                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,0)))
#define TSB_AD_MOD1_ADEN                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,7)))
#define TSB_AD_MOD2_ADBFN                (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2,0)))
#define TSB_AD_MOD2_ADSFN                (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2,1)))
#define TSB_AD_CMPCR0_ADBIG0             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,4)))
#define TSB_AD_CMPCR0_CMP0EN             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,7)))
#define TSB_AD_CMPCR1_ADBIG1             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,4)))
#define TSB_AD_CMPCR1_CMP1EN             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,7)))
#define TSB_AD_REG0_ADR0RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG0,0)))
#define TSB_AD_REG0_OVR0                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG0,1)))
#define TSB_AD_REG1_ADR1RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG1,0)))
#define TSB_AD_REG1_OVR1                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG1,1)))
#define TSB_AD_REG2_ADR2RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG2,0)))
#define TSB_AD_REG2_OVR2                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG2,1)))
#define TSB_AD_REG3_ADR3RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG3,0)))
#define TSB_AD_REG3_OVR3                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG3,1)))
#define TSB_AD_REG4_ADR4RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG4,0)))
#define TSB_AD_REG4_OVR4                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG4,1)))
#define TSB_AD_REG5_ADR5RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG5,0)))
#define TSB_AD_REG5_OVR5                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG5,1)))
#define TSB_AD_REG6_ADR6RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG6,0)))
#define TSB_AD_REG6_OVR6                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG6,1)))
#define TSB_AD_REG7_ADR7RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG7,0)))
#define TSB_AD_REG7_OVR7                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG7,1)))
#define TSB_AD_REG8_ADR8RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG8,0)))
#define TSB_AD_REG8_OVR8                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG8,1)))
#define TSB_AD_REG9_ADR9RF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG9,0)))
#define TSB_AD_REG9_OVR9                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG9,1)))
#define TSB_AD_REG10_ADR10RF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,0)))
#define TSB_AD_REG10_OVR10               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,1)))
#define TSB_AD_REG11_ADR11RF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,0)))
#define TSB_AD_REG11_OVR11               (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,1)))
#define TSB_AD_PSEL0_PENS0               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL0,7)))
#define TSB_AD_PSEL1_PENS1               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL1,7)))
#define TSB_AD_PSEL2_PENS2               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL2,7)))
#define TSB_AD_PSEL3_PENS3               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL3,7)))
#define TSB_AD_PSET00_ENSP00             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET00,7)))
#define TSB_AD_PSET01_ENSP01             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET01,7)))
#define TSB_AD_PSET02_ENSP02             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET02,7)))
#define TSB_AD_PSET03_ENSP03             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET03,7)))
#define TSB_AD_PSET10_ENSP10             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET10,7)))
#define TSB_AD_PSET11_ENSP11             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET11,7)))
#define TSB_AD_PSET12_ENSP12             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET12,7)))
#define TSB_AD_PSET13_ENSP13             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET13,7)))
#define TSB_AD_PSET20_ENSP20             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET20,7)))
#define TSB_AD_PSET21_ENSP21             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET21,7)))
#define TSB_AD_PSET22_ENSP22             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET22,7)))
#define TSB_AD_PSET23_ENSP23             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET23,7)))
#define TSB_AD_PSET30_ENSP30             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET30,7)))
#define TSB_AD_PSET31_ENSP31             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET31,7)))
#define TSB_AD_PSET32_ENSP32             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET32,7)))
#define TSB_AD_PSET33_ENSP33             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET33,7)))
#define TSB_AD_PSET40_ENSP40             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET40,7)))
#define TSB_AD_PSET41_ENSP41             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET41,7)))
#define TSB_AD_PSET42_ENSP42             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET42,7)))
#define TSB_AD_PSET43_ENSP43             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET43,7)))
#define TSB_AD_PSET50_ENSP50             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET50,7)))
#define TSB_AD_PSET51_ENSP51             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET51,7)))
#define TSB_AD_PSET52_ENSP52             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET52,7)))
#define TSB_AD_PSET53_ENSP53             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET53,7)))
#define TSB_AD_TSET0_ENST0               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET0,7)))
#define TSB_AD_TSET1_ENST1               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET1,7)))
#define TSB_AD_TSET2_ENST2               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET2,7)))
#define TSB_AD_TSET3_ENST3               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET3,7)))
#define TSB_AD_TSET4_ENST4               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET4,7)))
#define TSB_AD_TSET5_ENST5               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET5,7)))
#define TSB_AD_TSET6_ENST6               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET6,7)))
#define TSB_AD_TSET7_ENST7               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET7,7)))
#define TSB_AD_TSET8_ENST8               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET8,7)))
#define TSB_AD_TSET9_ENST9               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET9,7)))
#define TSB_AD_TSET10_ENST10             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET10,7)))
#define TSB_AD_TSET11_ENST11             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET11,7)))
#define TSB_AD_SSET0_ENSS0               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET0,7)))
#define TSB_AD_SSET1_ENSS1               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET1,7)))
#define TSB_AD_SSET2_ENSS2               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET2,7)))
#define TSB_AD_SSET3_ENSS3               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET3,7)))
#define TSB_AD_SSET4_ENSS4               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET4,7)))
#define TSB_AD_SSET5_ENSS5               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET5,7)))
#define TSB_AD_SSET6_ENSS6               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET6,7)))
#define TSB_AD_SSET7_ENSS7               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET7,7)))
#define TSB_AD_SSET8_ENSS8               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET8,7)))
#define TSB_AD_SSET9_ENSS9               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET9,7)))
#define TSB_AD_SSET10_ENSS10             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET10,7)))
#define TSB_AD_SSET11_ENSS11             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET11,7)))
#define TSB_AD_ASET0_ENSA0               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET0,7)))
#define TSB_AD_ASET1_ENSA1               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET1,7)))
#define TSB_AD_ASET2_ENSA2               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET2,7)))
#define TSB_AD_ASET3_ENSA3               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET3,7)))
#define TSB_AD_ASET4_ENSA4               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET4,7)))
#define TSB_AD_ASET5_ENSA5               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET5,7)))
#define TSB_AD_ASET6_ENSA6               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET6,7)))
#define TSB_AD_ASET7_ENSA7               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET7,7)))
#define TSB_AD_ASET8_ENSA8               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET8,7)))
#define TSB_AD_ASET9_ENSA9               (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET9,7)))
#define TSB_AD_ASET10_ENSA10             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET10,7)))
#define TSB_AD_ASET11_ENSA11             (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET11,7)))
#define TSB_AD_MOD3_RCUT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,8)))


/* Watchdog Timer (WD) */
#define TSB_WD_MOD_RESCR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))

/* Real Time Clock (RTC) */
#define TSB_RTC_MONTHR_MO0               (*((__IO uint32_t *)BITBAND_PERI(&TSB_RTC->MONTHR,0)))
       
