MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM380FYDFG/mcu.h
/* DMA Controller (DMAC) */
#define TSB_DMAC_INTSTATUS_INTSTATUS0      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTSTATUS,0)))
#define TSB_DMAC_INTSTATUS_INTSTATUS1      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTSTATUS,1)))
#define TSB_DMAC_INTTCSTATUS_INTTCSTATUS0  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTTCSTATUS,0)))
#define TSB_DMAC_INTTCSTATUS_INTTCSTATUS1  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTTCSTATUS,1)))
#define TSB_DMAC_INTERRORSTATUS_INTERRSTATUS0  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTERRORSTATUS,0)))
#define TSB_DMAC_INTERRORSTATUS_INTERRSTATUS1  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTERRORSTATUS,1)))
#define TSB_DMAC_RAWINTTCSTATUS_RAWINTTCS0 (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTTCSTATUS,0)))
#define TSB_DMAC_RAWINTTCSTATUS_RAWINTTCS1 (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTTCSTATUS,1)))
#define TSB_DMAC_RAWINTERRORSTATUS_RAWINTERRS0 (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTERRORSTATUS,0)))
#define TSB_DMAC_RAWINTERRORSTATUS_RAWINTERRS1 (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTERRORSTATUS,1)))
#define TSB_DMAC_ENBLDCHNS_ENABLEDCH0      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->ENBLDCHNS,0)))
#define TSB_DMAC_ENBLDCHNS_ENABLEDCH1      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->ENBLDCHNS,1)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ0        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,0)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ1        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,1)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ2        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,2)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ3        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,3)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ4        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,4)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ5        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,5)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ6        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,6)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ7        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,7)))
#define TSB_DMAC_SOFTBREQ_SOFTBREQ8        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTBREQ,8)))
#define TSB_DMAC_SOFTSREQ_SOFTSREQ6        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTSREQ,6)))
#define TSB_DMAC_SOFTSREQ_SOFTSREQ8        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->SOFTSREQ,8)))
#define TSB_DMAC_CONFIGURATION_E           (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->CONFIGURATION,0)))
#define TSB_DMAC_CONFIGURATION_M           (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->CONFIGURATION,1)))
#define TSB_DMAC_C0CONTROL_SI              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONTROL,26)))
#define TSB_DMAC_C0CONTROL_DI              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONTROL,27)))
#define TSB_DMAC_C0CONTROL_I               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONTROL,31)))
#define TSB_DMAC_C0CONFIGURATION_E         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,0)))
#define TSB_DMAC_C0CONFIGURATION_IE        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,14)))
#define TSB_DMAC_C0CONFIGURATION_ITC       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,15)))
#define TSB_DMAC_C0CONFIGURATION_LOCK      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,16)))
#define TSB_DMAC_C0CONFIGURATION_ACTIVE    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,17)))
#define TSB_DMAC_C0CONFIGURATION_HALT      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION,18)))
#define TSB_DMAC_C1CONTROL_SI              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONTROL,26)))
#define TSB_DMAC_C1CONTROL_DI              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONTROL,27)))
#define TSB_DMAC_C1CONTROL_I               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONTROL,31)))
#define TSB_DMAC_C1CONFIGURATION_E         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,0)))
#define TSB_DMAC_C1CONFIGURATION_IE        (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,14)))
#define TSB_DMAC_C1CONFIGURATION_ITC       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,15)))
#define TSB_DMAC_C1CONFIGURATION_LOCK      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,16)))
#define TSB_DMAC_C1CONFIGURATION_ACTIVE    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,17)))
#define TSB_DMAC_C1CONFIGURATION_HALT      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION,18)))

/* Synchronous Serial Port (SSP)*/
#define TSB_SSP0_CR0_SPO                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR0,6)))
#define TSB_SSP0_CR0_SPH                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR0,7)))
#define TSB_SSP0_CR1_LBM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,0)))
#define TSB_SSP0_CR1_SSE                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,1)))
#define TSB_SSP0_CR1_MS                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,2)))
#define TSB_SSP0_CR1_SOD                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->CR1,3)))
#define TSB_SSP0_SR_TFE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR ,0)))
#define TSB_SSP0_SR_TNF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR ,1)))
#define TSB_SSP0_SR_RNE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR ,2)))
#define TSB_SSP0_SR_RFF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR ,3)))
#define TSB_SSP0_SR_BSY                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR ,4)))
#define TSB_SSP0_IMSC_RORIM              (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,0)))
#define TSB_SSP0_IMSC_RTIM               (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,1)))
#define TSB_SSP0_IMSC_RXIM               (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,2)))
#define TSB_SSP0_IMSC_TXIM               (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->IMSC,3)))
#define TSB_SSP0_RIS_RORRIS              (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,0)))
#define TSB_SSP0_RIS_RTRIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,1)))
#define TSB_SSP0_RIS_RXRIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,2)))
#define TSB_SSP0_RIS_TXRIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,3)))
#define TSB_SSP0_MIS_RORMIS              (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,0)))
#define TSB_SSP0_MIS_RTMIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,1)))
#define TSB_SSP0_MIS_RXMIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,2)))
#define TSB_SSP0_MIS_TXMIS               (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,3)))
#define TSB_SSP0_DMACR_RXDMAE            (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->DMACR,0)))
#define TSB_SSP0_DMACR_TXDMAE            (*((__IO uint32_t *)BITBAND_PERI(&TSB_SSP0->DMACR,1)))

